In [167]:
! pip install openpyxl

import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import plotly.express as px

Requirement already satisfied: openpyxl in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\admin\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [168]:
reviews = pd.read_csv('airbnb_last_review.tsv', sep='\t')
price = pd.read_csv('airbnb_price.csv')
room_type = pd.read_csv('room_type.csv')

In [169]:
room_type.head()

,Unnamed: 0,listing_id,description,room_type
0,0,2595,Skylit Midtown Castle,Entire home/apt
1,1,3831,Cozy Entire Floor of Brownstone,Entire home/apt
2,2,5099,Large Cozy 1 BR Apartment In Midtown East,Entire home/apt
3,3,5178,Large Furnished Room Near B'way,private room
4,4,5238,Cute & Cozy Lower East Side 1 bdrm,Entire home/apt

In [170]:
reviews.head()

   listing_id    host_name   last_review
0        2595     Jennifer   May 21 2019
1        3831  LisaRoxanne  July 05 2019
2        5099        Chris  June 22 2019
3        5178     Shunichi  June 24 2019
4        5238          Ben  June 09 2019

In [171]:
price.head()

   listing_id        price                nbhood_full
0        2595  225 dollars         Manhattan, Midtown
1        3831   89 dollars     Brooklyn, Clinton Hill
2        5099  200 dollars     Manhattan, Murray Hill
3        5178   79 dollars  Manhattan, Hell's Kitchen
4        5238  150 dollars       Manhattan, Chinatown

In [172]:
room_type.head()

,Unnamed: 0,listing_id,description,room_type
0,0,2595,Skylit Midtown Castle,Entire home/apt
1,1,3831,Cozy Entire Floor of Brownstone,Entire home/apt
2,2,5099,Large Cozy 1 BR Apartment In Midtown East,Entire home/apt
3,3,5178,Large Furnished Room Near B'way,private room
4,4,5238,Cute & Cozy Lower East Side 1 bdrm,Entire home/apt

In [173]:
combined = pd.merge(reviews, price, on="listing_id").merge(room_type, on="listing_id")
id = combined['listing_id']

In [174]:
combined.head()

,listing_id,host_name,last_review,price,nbhood_full,Unnamed: 0,description,room_type
0,2595,Jennifer,May 21 2019,225 dollars,"Manhattan, Midtown",0,Skylit Midtown Castle,Entire home/apt
1,3831,LisaRoxanne,July 05 2019,89 dollars,"Brooklyn, Clinton Hill",1,Cozy Entire Floor of Brownstone,Entire home/apt
2,5099,Chris,June 22 2019,200 dollars,"Manhattan, Murray Hill",2,Large Cozy 1 BR Apartment In Midtown East,Entire home/apt
3,5178,Shunichi,June 24 2019,79 dollars,"Manhattan, Hell's Kitchen",3,Large Furnished Room Near B'way,private room
4,5238,Ben,June 09 2019,150 dollars,"Manhattan, Chinatown",4,Cute & Cozy Lower East Side 1 bdrm,Entire home/apt

In [175]:
combined = combined.drop(['Unnamed: 0'], axis=1)

In [176]:
combined.head()

,listing_id,host_name,last_review,price,nbhood_full,description,room_type
0,2595,Jennifer,May 21 2019,225 dollars,"Manhattan, Midtown",Skylit Midtown Castle,Entire home/apt
1,3831,LisaRoxanne,July 05 2019,89 dollars,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,Entire home/apt
2,5099,Chris,June 22 2019,200 dollars,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,Entire home/apt
3,5178,Shunichi,June 24 2019,79 dollars,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room
4,5238,Ben,June 09 2019,150 dollars,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,Entire home/apt

In [177]:
last_review = combined['last_review']

In [178]:
last_review

0         May 21 2019
1        July 05 2019
2        June 22 2019
3        June 24 2019
4        June 09 2019
             ...
25204    July 07 2019
25205    July 07 2019
25206    July 07 2019
25207    July 07 2019
25208    July 08 2019
Name: last_review, Length: 25209, dtype: object

In [179]:
rvs = pd.concat([id, last_review], axis=1)

In [180]:
rvs = rvs.sort_values(by='last_review', ascending=False)
rvs.head()

       listing_id  last_review
1988      1971200  May 31 2019
10919    20440757  May 31 2019
7543     14602894  May 31 2019
11095    20714517  May 31 2019
11096    20720290  May 31 2019

### Dates of earliest and most recent listing

In [181]:
earliest_review = rvs['last_review'].min()
most_recent_review = rvs['last_review'].max()

recent_reviews = pd.DataFrame({
    'Review Type': ['Earliest', 'Most Recent'],
    'Date': [earliest_review, most_recent_review]
})

recent_reviews

   Review Type           Date
0     Earliest  April 01 2019
1  Most Recent    May 31 2019

### How many of the listings are private rooms

In [182]:
combined.head()

,listing_id,host_name,last_review,price,nbhood_full,description,room_type
0,2595,Jennifer,May 21 2019,225 dollars,"Manhattan, Midtown",Skylit Midtown Castle,Entire home/apt
1,3831,LisaRoxanne,July 05 2019,89 dollars,"Brooklyn, Clinton Hill",Cozy Entire Floor of Brownstone,Entire home/apt
2,5099,Chris,June 22 2019,200 dollars,"Manhattan, Murray Hill",Large Cozy 1 BR Apartment In Midtown East,Entire home/apt
3,5178,Shunichi,June 24 2019,79 dollars,"Manhattan, Hell's Kitchen",Large Furnished Room Near B'way,private room
4,5238,Ben,June 09 2019,150 dollars,"Manhattan, Chinatown",Cute & Cozy Lower East Side 1 bdrm,Entire home/apt

In [183]:
combined['room_type'].value_counts()

room_type
Entire home/apt    8458
Private room       7241
entire home/apt    2665
private room       2248
ENTIRE HOME/APT    2143
PRIVATE ROOM       1867
Shared room         380
shared room         110
SHARED ROOM          97
Name: count, dtype: int64

In [194]:
private_room_count = combined['room_type'].str.lower().str.contains('private room').sum()
print(f"Total number of private rooms: {private_room_count}")

Total number of private rooms: 11356

<b> around 11,356 rooms are private

### Average listing price

In [184]:
price = combined['price'].str.replace('dollars', '').astype(float)
id = combined['listing_id']

In [185]:
price

0        225.0
1         89.0
2        200.0
3         79.0
4        150.0
         ...
25204    129.0
25205     45.0
25206    235.0
25207    100.0
25208     30.0
Name: price, Length: 25209, dtype: float64

In [186]:
prices = pd.concat([id, price], axis=1)
prices.head()

   listing_id  price
0        2595  225.0
1        3831   89.0
2        5099  200.0
3        5178   79.0
4        5238  150.0

In [187]:
prices['price'].describe()

count    25209.000000
mean       141.777936
std        147.349137
min          0.000000
25%         69.000000
50%        105.000000
75%        175.000000
max       7500.000000
Name: price, dtype: float64

In [193]:
print(f"Average Listing Price: {avg_price:.2f}")

Average Listing Price: 141.78

<b> The mean price is 141.777

### Combine new variables into dataframe called review dates: <br>
* first_reviewed
*last_reviewed
nb_private_rooms
avg-price

In [188]:
recently_reviewd = {
    'first_reviewed' : 'April 01 2019',
    'last_reviewed' : 'May 31 2019',
    'nb_private_rooms' : 11356,
    'avg_price' : "141.77 dollars",
}

In [189]:
recently_reviewed = pd.DataFrame.from_dict(recently_reviewd, orient='index')

In [190]:
recently_reviewed.T

  first_reviewed last_reviewed nb_private_rooms       avg_price
0  April 01 2019   May 31 2019            11356  141.77 dollars

In [192]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import plotly.express as px

# Import necessary libraries

# Load datasets
reviews = pd.read_csv('airbnb_last_review.tsv', sep='\t')
price = pd.read_csv('airbnb_price.csv')
room_type = pd.read_csv('room_type.csv')

# Merge datasets into a single DataFrame
combined = pd.merge(reviews, price, on="listing_id").merge(room_type, on="listing_id")

# Drop unnecessary columns
if 'Unnamed: 0' in combined.columns:
    combined = combined.drop(['Unnamed: 0'], axis=1)

# Display the first few rows of the combined DataFrame
print("Combined DataFrame:")
print(combined.head())

# Extract and sort reviews by last review date
rvs = combined[['listing_id', 'last_review']].sort_values(by='last_review', ascending=False)
print("\nSorted Reviews by Last Review Date:")
print(rvs.head())

# Find earliest and most recent review dates
earliest_review = rvs['last_review'].min()
most_recent_review = rvs['last_review'].max()

recent_reviews = pd.DataFrame({
    'Review Type': ['Earliest', 'Most Recent'],
    'Date': [earliest_review, most_recent_review]
})
print("\nEarliest and Most Recent Reviews:")
print(recent_reviews)

# Count the number of private rooms
nb_private_rooms = combined['room_type'].str.lower().value_counts().get('private room', 0)
print(f"\nNumber of Private Rooms: {nb_private_rooms}")

# Calculate average listing price
combined['price'] = combined['price'].str.replace('dollars', '').astype(float)
avg_price = combined['price'].mean()
print(f"\nAverage Listing Price: {avg_price:.2f}")

# Create a summary DataFrame
summary = {
    'first_reviewed': earliest_review,
    'last_reviewed': most_recent_review,
    'nb_private_rooms': nb_private_rooms,
    'avg_price': f"{avg_price:.2f} dollars"
}
summary_df = pd.DataFrame([summary])
print("\nSummary DataFrame:")
print(summary_df)

Combined DataFrame:
   listing_id    host_name   last_review        price  \
0        2595     Jennifer   May 21 2019  225 dollars
1        3831  LisaRoxanne  July 05 2019   89 dollars
2        5099        Chris  June 22 2019  200 dollars
3        5178     Shunichi  June 24 2019   79 dollars
4        5238          Ben  June 09 2019  150 dollars

                 nbhood_full                                description  \
0         Manhattan, Midtown                      Skylit Midtown Castle
1     Brooklyn, Clinton Hill            Cozy Entire Floor of Brownstone
2     Manhattan, Murray Hill  Large Cozy 1 BR Apartment In Midtown East
3  Manhattan, Hell's Kitchen            Large Furnished Room Near B'way
4       Manhattan, Chinatown         Cute & Cozy Lower East Side 1 bdrm

         room_type
0  Entire home/apt
1  Entire home/apt
2  Entire home/apt
3     private room
4  Entire home/apt

Sorted Reviews by Last Review Date:
       listing_id  last_review
1988      1971200  May 31 2019
10919    20440757  May 31 2019
7543     14602894  May 31 2019
11095    20714517  May 31 2019
11096    20720290  May 31 2019

Earliest and Most Recent Reviews:
   Review Type           Date
0     Earliest  April 01 2019
1  Most Recent    May 31 2019

Number of Private Rooms: 11356

Average Listing Price: 141.78

Summary DataFrame:
  first_reviewed last_reviewed  nb_private_rooms       avg_price
0  April 01 2019   May 31 2019             11356  141.78 dollars

  first_reviewed last_reviewed nb_private_rooms       avg_price
0  April 01 2019   May 31 2019            11356  141.78 dollars